import React from 'react'

const Description = () => {
  return (
    <p className='text-[18px]'>
        Интернет магазин "E-commerce" - построен полностью на запросах.
        Реализована корзина товаров, сортировка товаров по категориям, поиск по
        названию. Есть личный кабинет для покупателей, где можно посмотреть
        информацию о пользователе и историю заказов & личный кабинет для
        администратора, где можно добавить категорию или новый товар. Так же
        администратор можeт отредактировать уже имеющийся товар в карточке
        товара. Есть возможность зарегестрироваться и выбрать категорию профиля
        (администратор/покупатель) Реализована подгрузка товаров на страницу.
        BackEnd сделан с помощью JSON Server.
      </p>
  )
}

export default Description